import numpy as np

def solve_gauss(n: int, b: np.ndarray, a_param: float = -0.99) -> np.ndarray:
    """
    решает СЛАУ с помощью метода гаусса с выбором главного элемента по столбцу
    оптимизирован под значения a <= 1 и структуру матрицы
    """
    
    # --- описание алгоритма ---
    """
    рассмотрим на примере размером 6 на 6
    1 0 0 0 0 1 | b1
    a 1 0 0 0 1 | b2
    a a 1 0 0 1 | b3
    a a a 1 0 1 | b4
    a a a a 1 1 | b5
    a a a a a 1 | b6
    
    так как |a| = 0.99 < 1, то -- менять строки местами при выборе главного элемента мы не будем
    и соответсвенно -- структура не поломается
    
    далее я покажу, как выглядит структура по ходу вычислений
    
    1:
    1 0 0 0 0 (1)     | b1
    0 1 0 0 0 (1 - a) | b2 - a*b1
    0 a 1 0 0 (1 - a) | b3 - a*b1
    0 a a 1 0 (1 - a) | b4 - a*b1
    0 a a a 1 (1 - a) | b5 - a*b1
    0 a a a a (1 - a) | b6 - a*b1
    
    2:
    1 0 0 0 0 (1 - a)^0 | b1
    0 1 0 0 0 (1 - a)^1 | b2 - a*b1
    0 0 1 0 0 (1 - a)^2 | b3 - a*b1 - a * (b2 - a*b1)
    0 0 a 1 0 (1 - a)^2 | b4 - a*b1 - a * (b2 - a*b1)
    0 0 a a 1 (1 - a)^2 | b5 - a*b1 - a * (b2 - a*b1)
    0 0 a a a (1 - a)^2 | b6 - a*b1 - a * (b2 - a*b1)
    
    и так далее
    
    в итоге мы получаем 
    [r|b']
    1 0 0 0 0 (1 - a)^0 | b1' = b1
    0 1 0 0 0 (1 - a)^1 | b2' = b2 - a * (b1')
    0 0 1 0 0 (1 - a)^2 | b3' = b3 - a * (b1' + b2') 
    0 0 0 1 0 (1 - a)^3 | b4' = b4 - a * (b1' + b2' + b3')
    0 0 0 0 1 (1 - a)^4 | b5' = b5 - a * (b1' + b2' + b3' + b4')
    0 0 0 0 0 (1 - a)^5 | b6' = b6 - a * (b1' + b2' + b3' + b4' + b5')
    
    то есть
    # b'[i] = b[i] - a * sum(b'[j] for j < i)
    
    
    далее, давайте покажу обратный ход
    
    1 0 0 0 0 0 | b1' - b6'/(1 - a)^5
    0 1 0 0 0 0 | b2' - b6'/(1 - a)^4
    0 0 1 0 0 0 | b3' - b6'/(1 - a)^3
    0 0 0 1 0 0 | b4' - b6'/(1 - a)^2
    0 0 0 0 1 0 | b5'- b6'/(1 - a)^1
    0 0 0 0 0 1 | b6'/(1 - a)^5
    
    то есть, итого 
    нам нужно посчитать b' 
    и получить x_i = b_i' - b_n'/[(1 - a)^(n - i)]
    
    вот итоговая реализация алгоритма
    """
    # --- инициализация ---
    b_prime = b.copy() # копируем, чтобы не испортить 

    # --- прямой ход (вычисление b') ---
    # O(n^2)
    for i in range(1, n): # O(n)
        sum_b = a_param * np.sum(b_prime[:i]) # O(n)
        b_prime[i] -= sum_b

    # --- обратный ход (вычисление x) ---
    x_computed = np.zeros(n, dtype=float)    # O(n)
    
    # --- вычисляем последний элемент x ---
    last_term_denom = (1 - a_param) ** (n - 1)
    if last_term_denom == 0:
        raise ValueError("деление на ноль в обратном ходе, (1-a)^(n-1) равно нулю.")
    x_computed[n - 1] = b_prime[n - 1] / last_term_denom 
    
    # --- вычисляем остальные элементы x по выведенной формуле ---
    for i in range(n - 2, -1, -1):    # O(n)
        correction_term = ((1 - a_param) ** i) * x_computed[n - 1]
        x_computed[i] = b_prime[i] - correction_term
        
    return x_computed

    """
    итого O(n^2) + O(n) = O(n^2)
    """