INSERT INTO TEACHERS_25 (TNUM, TFAM, TIMA, TOTCH, TDATE)
VALUES
(4001, N'Вакулина', N'Валентина', N'Ивановна', CONVERT(datetime, '1984-04-01 00:00:00.000', 120)),
(4002, N'Костыркин', N'Олег', N'Владиморович', CONVERT(datetime, '1987-01-01 00:00:00.000', 120)),
(4003, N'Казанко', N'Виталий', N'Владимирович', CONVERT(datetime, '1988-09-01 00:00:00.000', 120)),
(4004, N'Позднякова', N'Любовь', N'Алексеевна', CONVERT(datetime, '1988-09-01 00:00:00.000', 120)),
(4005, N'Загарийчук', N'Игорь', N'Дмитреевич', CONVERT(datetime, '1989-05-10 00:00:00.000', 120)),
(4006, N'Фамилия', N'Имя', N'Отчество', CONVERT(datetime, '1999-05-31 00:00:00.000', 120));
   
